tutorials/heatTransfer/buoyantSimpleFoam/hotRadiationRoomFvDOM/constant/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiationModel  fvDOM;

fvDOMCoeffs
{
    nPhi    3;          // azimuthal angles in PI/2 on X-Y.(from Y to X)
    nTheta  5;          // polar angles in PI (from Z to X-Y plane)
    convergence 1e-3;   // convergence criteria for radiation iteration
    maxIter 10;         // maximum number of iterations
}

// Number of flow iterations per radiation iteration
solverFreq 10;

absorptionEmissionModel constantAbsorptionEmission;

constantAbsorptionEmissionCoeffs
{
   absorptivity    absorptivity    [ 0 -1 0 0 0 0 0 ] 0.01;
   emissivity      emissivity      [ 0 -1 0 0 0 0 0 ] 0.01;
   E               E   [ 1 -1 -3 0 0 0 0 ] 0;
}

scatterModel    none;


// ************************************************************************* //
